Configuration_project_01/src/DataProcessors/ПанельАдминистрированияУчетПрослеживаемыхТоваров/ПанельАдминистрированияУчетПрослеживаемыхТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельАдминистрированияУчетПрослеживаемыхТоваров</name>
</mdclass:DataProcessor>

Configuration_project_01/src/AccumulationRegisters/ТоварыПереданныеНаКомиссию/ТоварыПереданныеНаКомиссию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыПереданныеНаКомиссию</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаВыручки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВознаграждения</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Configuration_project_01/src/DataProcessors/ПанельАдминистрированияУчетПрослеживаемыхТоваров/Forms/ОформлениеВозвратовОтКомиссионеров/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравоОформленияВозврата = ПравоДоступа("Добавление", Метаданные.Документы.ВозвратТоваровОтКлиента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"ТаблицаКОформлениюОформитьВозврат",
	"Доступность",
	ПравоОформленияВозврата);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"ТаблицаКОформлениюОформитьВсеВозвраты",
	"Доступность",
	ПравоОформленияВозврата);
	
	Склад = Параметры.Склад;
	ЗаполнитьТаблицуКОформлению();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОформитьВозврат(Команда)
	
	Если Элементы.ТаблицаКОформлению.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаИД Из Элементы.ТаблицаКОформлению.ВыделенныеСтроки Цикл
		
		Организация      = Элементы.ТаблицаКОформлению.ДанныеСтроки(СтрокаИД).Организация;
		Комиссионер      = Элементы.ТаблицаКОформлению.ДанныеСтроки(СтрокаИД).Комиссионер;
		Соглашение       = Элементы.ТаблицаКОформлению.ДанныеСтроки(СтрокаИД).Соглашение;
		
		Попытка
			СоздатьДокументВозвратТоваров(Организация, Комиссионер, Соглашение);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаполнитьТаблицуКОформлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьВсеВозвраты(Команда)
	
	Для Каждого Строка Из ТаблицаКОформлению Цикл
		
		СоздатьДокументВозвратТоваров(Строка.Организация, Строка.Комиссионер, Строка.Соглашение);
		
	КонецЦикла;
	
	ЗаполнитьТаблицуКОформлению();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуКОформлению()
	
	Запрос = Новый Запрос;
	Запрос.Текст = Обработки.ПанельАдминистрированияУчетПрослеживаемыхТоваров.СформироватьТекстЗапросаТаблицаВозвратыТоваровОтКомиссионеров();
	
	Запрос.УстановитьПараметр("ДатаПрослеживаемости", Константы.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаКОформлению.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументВозвратТоваров(Организация, Комиссионер, Соглашение)
	
	ДокументВозврат = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
	ДокументВозврат.Дата                  = ТекущаяДатаСеанса();
	ДокументВозврат.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера;
	ДокументВозврат.Организация           = Организация;
	ДокументВозврат.Партнер               = Комиссионер;
	ДокументВозврат.Соглашение            = Соглашение;
	ДокументВозврат.Склад                 = Склад;
	ДокументВозврат.ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
	
	ДокументВозврат.ЗаполнитьУсловияПродажПоСоглашению();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		|	ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
		|	ТоварыПереданныеНаКомиссиюОстатки.КоличествоОстаток КАК Количество,
		|	ТоварыПереданныеНаКомиссиюОстатки.НомерГТД КАК НомерГТД,
		|	ТоварыПереданныеНаКомиссиюОстатки.КоличествоОстаток КАК КоличествоУпаковок,
		|	ТоварыПереданныеНаКомиссиюОстатки.КоличествоОстаток КАК КоличествоПоРНПТ,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Номенклатура.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(
		|			,
		|			Соглашение = &Соглашение
		|				И Организация = &Организация
		|				И АналитикаУчетаНоменклатуры.МестоХранения = &МестоХранения) КАК ТоварыПереданныеНаКомиссиюОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|			И ТоварыПереданныеНаКомиссиюОстатки.Соглашение.ВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|ГДЕ
		|	ТоварыПереданныеНаКомиссиюОстатки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
		|	И ТоварыПереданныеНаКомиссиюОстатки.НомерГТД.РНПТ = ЛОЖЬ
		|	И ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар = ИСТИНА
		|	И ТоварыПереданныеНаКомиссиюОстатки.Соглашение.КомиссионерВедетУчетПоРНПТ
		|	И ТоварыПереданныеНаКомиссиюОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МестоХранения", Комиссионер);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТовары =ДокументВозврат.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаДетальныеЗаписи);
		
		// пересчет цен и сумм в зависимости от включения НДС в цену
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументВозврат);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		
		Если ДокументВозврат.ЦенаВключаетНДС Тогда
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		КонецЕсли;
		
		Для Каждого Строка Из ДокументВозврат.Товары Цикл
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);
		КонецЦикла;
		
		// сумма документа
		ДокументВозврат.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(ДокументВозврат.Товары, ДокументВозврат.ЦенаВключаетНДС);
		
	КонецЦикла;
	
	ПараметрыЗаполнения = Документы.ВозвратТоваровОтКлиента.ПараметрыЗаполненияНалогообложенияНДСПродажи(ДокументВозврат);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(Неопределено, ПараметрыЗаполнения);
	
	ПродажиСервер.ЗаполнитьРеализацииИЦены(ДокументВозврат, "Товары");
	
	ДокументВозврат.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти
